#include<stdio.h>
int main()
{
	
	char a=-1;
	//-1为负整数，在内存中的存储为补码
	//原码                           10000000 00000000 00000000 00000001
	//反码 符号位不变，其余按位取反  11111111 11111111 11111111 11111110
	//补码 反码+1                    11111111 11111111 11111111 11111111
//	char 是一个字节，所以会丢失掉
//	                               11111111 
	//char要打印出来时要进行整型提升 符号位为1全部补1         11111111 11111111 11111111 11111111此时为补码，再转换成原码就是-1啦 
	
	
	
	unsigned char b=-1;
	//因为是无符号的所以整形提升时，高位补0                      00000000 00000000 00000000 11111111
	
	printf("%d",a);
	
	
	
	printf("%d",b);
	
	
	
	
	return 0;
 } 
